<template>
    <div id="DBN">
        <h1>深度信念网络(DBN)</h1>
        <h2>简介</h2>
        <p>
            2006年，Hinton提出了“深度信念网络”，并给出了该模型一个高效的学习算法，这也成为了深度学习算法的主要框架，在该算法中，一个DBN由若干个RBM堆叠而成，训练过程由低到高逐层进行训练，如下图所示
        </p>
        <img src="http://120.79.17.239/1009/c43f0412-4592-11e9-8a77-00163e021e9c.png"/>
        <p>
            一个RBM由可见层、隐层组成，显示用于接受输入，隐元用于提取特征，因此隐元也有个别名，叫特征检测器，也就是说，通过RBM训练之后，可以得到输入数据的特征。另外，RBM还通过学习将数据表示成概率模型，一旦模型通过无监督学习被训练或收敛到一个稳定的状态，它还可以被用于生成新数据。
        </p>
        <p>
            正是由于RBM的以上特点，使得DBN逐层进行训练变得有效，通过隐层提取特征使后面层次的训练数据更加有代表性，通过可生成新数据能解决样本量不足的问题。逐层的训练过程如下：
        </p>
        <p>(1）最底部RBM以原始输入数据进行训练</p>
        <p>(2) 将底部RBM抽取的特征作为顶部RBM的输入继续训练</p>
        <p>(3) 重复这个过程训练以尽可能多的RBM层</p>
        <p>
            由于RBM可通过CD快速训练，于是这个框架绕过直接从整体上对DBN高度复杂的训练后，可以再通过传统的全局学习算法（BP算法）对网络进行微调，从而使模型收敛到局部最优点，通过这种方式可高效训练出一个深层网络出来，
        </p>
        <img src="http://120.79.17.239/1009/21140e66-459e-11e9-8a77-00163e021e9c.png"/>
    </div>
</template>
<style lang='scss'>
#DBN {
    padding-left: 40px;
    h1 {
        padding: 50px 0 25px;
        font-size: 28px;
        line-height: 28px;
        color: #000;
        border-bottom: 1px solid #e8e8e8;
    }
    h2 {
        padding: 34px 0 14px;
        font-size: 24px;
        line-height: 30px;
        color: #000;
    }
}
</style>
